export const generalQuestion: { [key: string]: string } = {
  Q1: `ถ้าน้องถูกจารึกไว้ในประวัติศาสตร์ว่าเป็นบุคคลสำคัญ น้องคิดว่าตัวเองควรถูกจารึกไว้ในด้านใด ด้วยเหตุผลอะไร ?`,
  Q2: `ถ้าน้องต้องการแก้ปัญหาเรื่องฝุ่น PM2.5 น้องคิดว่าการแก้ปัญหาต้องเริ่มที่ภาคประชาชนหรือภาครัฐ เพราะเหตุผลอะไร และน้องจะเสนอแนวทางการแก้ปัญหานี้อย่างไร ?`,
  Q3: `มีเรื่องอะไรที่น้องรู้สึกว่ามันแย่มากๆ ไม่สมควรเกิดขึ้นเลย! แต่ตัวน้องกลับไม่สามารถทำอะไรเลย เล่ามาให้ฟังหน่อย จะเป็นประสบการณ์ส่วนตัวหรือเรื่องสังคมก็ได้ ถ้าหากน้องมีโอกาสแก้ไข น้องจะทำอย่างไร ?`,
}

export const tracks: {
  [key: string]: { title: string; questions: { [key: string]: string } }
} = {
  developer: {
    title: 'Developer',
    questions: {
      Q1: `น้องเห็นด้วยกับคำว่า "Artificial Intelligence (AI) ควรถูกพัฒนาไปอย่างไม่มีข้อจำกัด" หรือไม่ เพราะเหตุใด (สามารถอ้างอิงแหล่งที่มาของข้อความที่ยกมาได้) ?`,
      Q2: `ลองเขียนโปรแกรมเพื่อแนะแนะนำบุคคลสำคัญที่น้องชื่นชอบคนใดก็ได้สั้น ๆ ในรูปแบบใดก็ได้ ไม่ว่าจะเป็นเว็บไซต์, โปรแกรม command line หรือรูปแบบอื่น ๆ ตามที่ต้องการ (ถ้าเป็นโค้ด HTML สามารถวางในช่องด้านล่างได้เลย หรือสามารถส่งโค้ดผ่าน GitHub, Gitlab, Gist หรือแพลตฟอร์มอื่น ๆ ด้วยการใส่ URL)`,
    },
  },
  designer: {
    title: 'Designer',
    questions: {
      Q1__Upload: `ให้น้องลองออกแบบโลโก้ค่าย YCC ขึ้นมาใหม่ในแบบของน้อง (สามารถถ่ายภาพวาดบนกระดาษ หรือ ออกแบบบนโปรแกรมต่าง ๆ ได้) พร้อมอธิบายแนวคิดในการออกแบบโลโก้นี้ โดยสามารถดาวน์โหลดไฟล์โลโก้ปัจจุบันได้ <a href='/static/y-2020.svg' target='_blank' rel='noopener noreferrer' style="color: #3182ce;">ที่นี่</a>`,
      Q2: `เคยรู้จักคำว่า Universal Design (ผลิตภัณฑ์ที่ใช้ได้กับทุกเพศทุกวัย) ไหม? ลองอธิบายความหมาย และยกตัวอย่างผลิตภัณฑ์ พร้อมอธิบายว่าทำไมมันจึงถูกออกแบบมาเช่นนี้ ในความคิดของตนเอง`,
    },
  },
  creative: {
    title: 'Creative',
    questions: {
      Q1: `ปัจจุบันโลกของเรากำลังเผชิญกับปัญหาในหลาย ๆ ด้าน ไม่ว่าจะเป็น ภัยพิบัติธรรมชาติ เศรษฐกิจ หรือด้านอื่น ๆ อีกมากมาย น้องมีวิธีการที่จะส่งเสริมให้ผู้คนตระหนักถึงเรื่องเหล่านี้มากขึ้นได้อย่างไร ?`,
      Q2: `ถ้าน้องเป็นนักวิทยาศาสตร์ที่รู้วิธีการรักษาของ "ไวรัสโคโรนา" และเมื่อนำเสนอวิธีการรักษานี้ออกไป ประชาชนกลับมองว่าเป็นวิธีการที่ไม่น่าเชื่อถือ น้องจะมีวิธีการหรือไอเดียในการสร้างความน่าเชื่อถือได้อย่างไร ?`,
    },
  },
}

export const religions = {
  atheist: 'ไม่นับถือศาสนา',
  buddhist: 'ศาสนาพุทธ',
  christianity: 'ศาสนาคริสต์',
  islam: 'ศาสนาอิสลาม',
  other: 'ศาสนาอื่นๆ',
}

export const grades = {
  m3: 'มัธยมศึกษาปีที่ 3',
  m4: 'มัธยมศึกษาปีที่ 4',
  m5: 'มัธยมศึกษาปีที่ 5',
  m6: 'มัธยมศึกษาปีที่ 6',
  p1: 'ปวช.',
  other: 'อื่นๆ',
  hs: 'Home School',
}

export const genders = {
  male: 'ชาย',
  female: 'หญิง',
  other: 'เพศอื่นๆ',
  none: 'ไม่ระบุ',
}

export const bloodGroups = {
  O: 'O',
  A: 'A',
  B: 'B',
  AB: 'AB',
}

export const shirtSizes = {
  XS: 'XS (รอบอก 31 นิ้ว ความยาว 25 นิ้ว)',
  S: 'S (รอบอก 36 นิ้ว ความยาว 28 นิ้ว)',
  M: 'M (รอบอก 38 นิ้ว ความยาว 28.5 นิ้ว)',
  L: 'L (รอบอก 42 นิ้ว ความยาว 30 นิ้ว)',
  XL: 'XL (รอบอก 44 นิ้ว ความยาว 30.5 นิ้ว)',
  XXL: 'XXL (รอบอก 48 นิ้ว ความยาว 32 นิ้ว)',
}

export const provinces = {
  กรุงเทพมหานคร: 'กรุงเทพมหานคร',
  สมุทรปราการ: 'สมุทรปราการ',
  นนทบุรี: 'นนทบุรี',
  ปทุมธานี: 'ปทุมธานี',
  พระนครศรีอยุธยา: 'พระนครศรีอยุธยา',
  อ่างทอง: 'อ่างทอง',
  ลพบุรี: 'ลพบุรี',
  สิงห์บุรี: 'สิงห์บุรี',
  ชัยนาท: 'ชัยนาท',
  สระบุรี: 'สระบุรี',
  ชลบุรี: 'ชลบุรี',
  ระยอง: 'ระยอง',
  จันทบุรี: 'จันทบุรี',
  ตราด: 'ตราด',
  ฉะเชิงเทรา: 'ฉะเชิงเทรา',
  ปราจีนบุรี: 'ปราจีนบุรี',
  นครนายก: 'นครนายก',
  สระแก้ว: 'สระแก้ว',
  นครราชสีมา: 'นครราชสีมา',
  บุรีรัมย์: 'บุรีรัมย์',
  สุรินทร์: 'สุรินทร์',
  ศรีสะเกษ: 'ศรีสะเกษ',
  อุบลราชธานี: 'อุบลราชธานี',
  ยโสธร: 'ยโสธร',
  ชัยภูมิ: 'ชัยภูมิ',
  อำนาจเจริญ: 'อำนาจเจริญ',
  หนองบัวลำภู: 'หนองบัวลำภู',
  ขอนแก่น: 'ขอนแก่น',
  อุดรธานี: 'อุดรธานี',
  เลย: 'เลย',
  หนองคาย: 'หนองคาย',
  มหาสารคาม: 'มหาสารคาม',
  ร้อยเอ็ด: 'ร้อยเอ็ด',
  กาฬสินธุ์: 'กาฬสินธุ์',
  สกลนคร: 'สกลนคร',
  นครพนม: 'นครพนม',
  มุกดาหาร: 'มุกดาหาร',
  เชียงใหม่: 'เชียงใหม่',
  ลำพูน: 'ลำพูน',
  ลำปาง: 'ลำปาง',
  อุตรดิตถ์: 'อุตรดิตถ์',
  แพร่: 'แพร่',
  น่าน: 'น่าน',
  พะเยา: 'พะเยา',
  เชียงราย: 'เชียงราย',
  แม่ฮ่องสอน: 'แม่ฮ่องสอน',
  นครสวรรค์: 'นครสวรรค์',
  อุทัยธานี: 'อุทัยธานี',
  กำแพงเพชร: 'กำแพงเพชร',
  ตาก: 'ตาก',
  สุโขทัย: 'สุโขทัย',
  พิษณุโลก: 'พิษณุโลก',
  พิจิตร: 'พิจิตร',
  เพชรบูรณ์: 'เพชรบูรณ์',
  ราชบุรี: 'ราชบุรี',
  กาญจนบุรี: 'กาญจนบุรี',
  สุพรรณบุรี: 'สุพรรณบุรี',
  นครปฐม: 'นครปฐม',
  สมุทรสาคร: 'สมุทรสาคร',
  สมุทรสงคราม: 'สมุทรสงคราม',
  เพชรบุรี: 'เพชรบุรี',
  ประจวบคีรีขันธ์: 'ประจวบคีรีขันธ์',
  นครศรีธรรมราช: 'นครศรีธรรมราช',
  กระบี่: 'กระบี่',
  พังงา: 'พังงา',
  ภูเก็ต: 'ภูเก็ต',
  สุราษฎร์ธานี: 'สุราษฎร์ธานี',
  ระนอง: 'ระนอง',
  ชุมพร: 'ชุมพร',
  สงขลา: 'สงขลา',
  สตูล: 'สตูล',
  ตรัง: 'ตรัง',
  พัทลุง: 'พัทลุง',
  ปัตตานี: 'ปัตตานี',
  ยะลา: 'ยะลา',
  นราธิวาส: 'นราธิวาส',
  บึงกาฬ: 'บึงกาฬ',
}
